adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf54h20_enga_secure</name>
  <series>nrf54h</series>
  <version>1</version>
  <description>LiliumSOC1 reference description for system-on-chip with many ARM 32-bit Cortex-M33 microcontrollers</description>
  <licenseText>
Copyright (c) 2010 - 2022, Nordic Semiconductor ASA

All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form, except as embedded into a Nordic
   Semiconductor ASA integrated circuit in a product or a software update for
   such product, must reproduce the above copyright notice, this list of
   conditions and the following disclaimer in the documentation and/or other
   materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

4. This software, with or without modification, must only be used with a
   Nordic Semiconductor ASA integrated circuit.

5. Any software provided in binary form under this license must not be reverse
   engineered, decompiled, modified and/or disassembled.

THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
      </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <cpu>
    <name>CM33</name>
    <revision>r0p4</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>0</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
    <deviceNumInterrupts>480</deviceNumInterrupts>
    <sauNumRegions>4</sauNumRegions>
  </cpu>
  <headerSystemFilename>system_nrf54h20_enga_secure</headerSystemFilename>
  <vendorExtensions>
    <MaxInterrupts>480</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>SICR_S</name>
      <description>Secure Information Configuration Registers</description>
      <baseAddress>0x0E000000</baseAddress>
      <headerStructName>SICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>SICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>IROT</name>
          <description>Information on immutable Root of Trust. Secure domain ROM writes these
      registers only in LCS Empty, RoT and DEPLOYED.</description>
          <headerStructName>SICR_IROT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0000</addressOffset>
          <cluster>
            <name>SYSROM</name>
            <description>32-bit base revision of SysCtrl ROM and upto eight patch revisions.</description>
            <headerStructName>SICR_IROT_SYSROM</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0000</addressOffset>
            <register>
              <name>BASE</name>
              <description>32-bit revision of base revision of SysCtrl ROM.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-write</access>
              <fields>
                <field>
                  <name>VERSION</name>
                  <description>Base revision.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>PATCH[%s]</name>
              <description>Description collection: 32-bit revision of utpo n patches.</description>
              <addressOffset>0x0004</addressOffset>
              <access>read-write</access>
              <fields>
                <field>
                  <name>VERSION</name>
                  <description>nth patch revision.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>UnPatched</name>
                      <description>No patch applied.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>SECROM</name>
            <description>32-bit revision of Secure Domain ROM base version and utpo sixteen patch versions.</description>
            <headerStructName>SICR_IROT_SECROM</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0024</addressOffset>
            <register>
              <name>BASE</name>
              <description>32-bit revision of base revision of Secure domain ROM.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-write</access>
              <fields>
                <field>
                  <name>VERSION</name>
                  <description>Base revision.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x10</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>PATCH[%s]</name>
              <description>Description collection: 32-bit revision of utpo n patches.</description>
              <addressOffset>0x0004</addressOffset>
              <access>read-write</access>
              <fields>
                <field>
                  <name>VERSION</name>
                  <description>nth patch revision.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>UnPatched</name>
                      <description>No patch applied.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DEVICEID[%s]</name>
            <description>Description collection: 128-bit UUID as Device Id.</description>
            <addressOffset>0x0070</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>UUID</name>
                <description>Device UUID [n]. The DEVICE.UUID[0] contains the least significant
          bits of the device identifier.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>UCODE</name>
            <description>32-bit revision of the CRACEN uCode.</description>
            <addressOffset>0x0080</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VALUE</name>
                <description>32-bit revision of CRACEN uCode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <cluster>
            <name>LCS1</name>
            <description>LCS reported here shall be indentical to the oe in LCS2.</description>
            <headerStructName>SICR_IROT_LCS1</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0084</addressOffset>
            <register>
              <name>LCS</name>
              <description>The device lifecycle state as determined by the secure domain ROM code.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-write</access>
              <fields>
                <field>
                  <name>STATE</name>
                  <description>The device lifecycle state.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Empty</name>
                      <description>LCS is EMPTY, device assets are installed in this state.</description>
                      <value>0x00001000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RoT</name>
                      <description>Updatable RoT is installed and is verified by the immutable RoT.</description>
                      <value>0x00002000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Deployed</name>
                      <description>Similar to LCS RoT, with device certificate installed.</description>
                      <value>0x00003000</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>LCS2</name>
            <description>LCS reported here shall be indentical to the oe in LCS1.</description>
            <headerStructName>SICR_IROT_LCS2</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0088</addressOffset>
            <register>
              <name>LCS</name>
              <description>The device lifecycle state as determined by the secure domain ROM code.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-write</access>
              <fields>
                <field>
                  <name>STATE</name>
                  <description>The device lifecycle state.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Empty</name>
                      <description>LCS is EMPTY, device assets are installed in this state.</description>
                      <value>0x00001000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RoT</name>
                      <description>Updatable RoT is installed and is verified by the immutable RoT.</description>
                      <value>0x00002000</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Deployed</name>
                      <description>Similar to LCS RoT, with device certificate installed.</description>
                      <value>0x00003000</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>BOOTSTATUS</name>
            <description>Status of boot when the secure domain firmware starts execution, or
        the secure domain firmware is not started in LCS RoT and DEPLOYED by
        secure domain ROM code.</description>
            <addressOffset>0x008C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>STATUS</name>
                <description>Status of boot.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>UROT</name>
          <description>Interface to store information related to the updateable RoT.</description>
          <headerStructName>SICR_UROT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x00F0</addressOffset>
          <cluster>
            <name>SM</name>
            <description>Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.</description>
            <headerStructName>SICR_UROT_SM</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0000</addressOffset>
            <cluster>
              <name>TBS</name>
              <description>Manifest describing the secure domain firmware.
          The secure domain ROM code verifies the signature on the digest of this register.</description>
              <headerStructName>SICR_UROT_SM_TBS</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0000</addressOffset>
              <cluster>
                <name>PUBKEY</name>
                <description>Raw public key used to verify the signed manifest.</description>
                <headerStructName>SICR_UROT_SM_TBS_PUBKEY</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0000</addressOffset>
                <register>
                  <name>SIZE</name>
                  <description>The size of the raw public key(in bytes).</description>
                  <addressOffset>0x0000</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>SIZE</name>
                      <description>Key size</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The key is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>SizeEd25519</name>
                          <description>The size of the raw Ed25519 public key.
                  Currently this is the only size supported by the secure domain ROM code.</description>
                          <value>0x00000020</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ADDR</name>
                  <description>Address of the raw public key.</description>
                  <addressOffset>0x0004</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>ADDR</name>
                      <description>Public key address.</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The key is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>LAYOUT</name>
                <description>The MRAM layout of UROT firmware and the recovery image.</description>
                <headerStructName>SICR_UROT_SM_TBS_LAYOUT</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0008</addressOffset>
                <cluster>
                  <name>USLOT</name>
                  <description>Start adddress and max size of UROT slot (USLOT), Shall remain the same for firmware
               updates once programmed or unless transitioned back to LCS Empty.</description>
                  <headerStructName>SICR_UROT_SM_TBS_LAYOUT_USLOT</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0000</addressOffset>
                  <register>
                    <name>START</name>
                    <description>Start address of the UROT firmware. Shall not overlap with the recovery slot (RSLOT).</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>ADDR</name>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Undefined</name>
                            <description>The slot is not defined.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>MAX</name>
                    <description>Maximum size of the UROT firmware in bytes.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>SIZE</name>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Undefined</name>
                            <description>The slot is not defined.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
                <cluster>
                  <name>RSLOT</name>
                  <description>Start adddress and max size of recovery slot (RSLOT), Shall remain the same for
                firmware updates once programmed or unless transitioned back to LCS Empty.</description>
                  <headerStructName>SICR_UROT_SM_TBS_LAYOUT_RSLOT</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0008</addressOffset>
                  <register>
                    <name>START</name>
                    <description>Start address of the recovery firmware. Shall not overlap with the UROT slot(USLOT).</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>ADDR</name>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Undefined</name>
                            <description>The slot is not defined.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>MAX</name>
                    <description>Maximum size of the recovery image in bytes.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>SIZE</name>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Undefined</name>
                            <description>The slot is not defined.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
              </cluster>
              <cluster>
                <name>FW</name>
                <description>FW verified by the secure domain ROM code.</description>
                <headerStructName>SICR_UROT_SM_TBS_FW</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0018</addressOffset>
                <register>
                  <name>SIZE</name>
                  <description>The firmware size (in bytes). Shall not exceed the max defined
              limits for USLOT in case of UROT firmware.Shall not exceed the max
              defined limits for USLOT in case of UROT firmware.</description>
                  <addressOffset>0x0000</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>SIZE</name>
                      <description>Firmware size</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The FW is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ADDR</name>
                  <description>Address of the firmware verified by the secure domain
              ROM code.</description>
                  <addressOffset>0x0004</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>ADDR</name>
                      <description>Firmware address</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The FW is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
