adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
                  <register>
                    <name>ADDR</name>
                    <description>Address of the firmware verified by the secure domain
              ROM code.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>ADDR</name>
                        <description>Firmware address</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <dim>0x10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>DIGEST[%s]</name>
                    <description>Description collection: SHA2-512 digest of the firmware.</description>
                    <addressOffset>0x0008</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>SHA2-512 Digest value</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW digest, and hence the FW is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <dim>0x4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>VERSION[%s]</name>
                    <description>Description collection: 128-bit revision of the firmware; can be left Unprogrammed.</description>
                    <addressOffset>0x0048</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>nth word of the version.</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>TIMESTAMP</name>
                    <description>Timestamp of the firmware in Unix time used to prevent
               downgrade of firmware on firmware update.</description>
                    <addressOffset>0x0058</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>Unix-time timestamp of the firmware</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW timestamp is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
                <cluster>
                  <name>POLICY</name>
                  <description>Set various policies on related to the firmware verification and
            update.</description>
                  <headerStructName>SICR_UROT_RECOVERY_SM_TBS_POLICY</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0074</addressOffset>
                  <register>
                    <name>UPDATE</name>
                    <description>Enable or Disable firmware update.</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>ENABLE</name>
                        <description>Possible values for this register.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The policy is not programmed, hence any existing policy
                  on update is left unchanged.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Enabled</name>
                            <description>Enable firmware update.</description>
                            <value>0xC3965A5A</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Disabled</name>
                            <description>Disable firmware update.</description>
                            <value>0x47D13CA5</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>REVOKE</name>
                    <description>Configure key revocation policy.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>ENABLE</name>
                        <description>Possible values for this register</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The policy is not programmed, hence any existing policy
                   on auto-revocation is left unchanged.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Enabled</name>
                            <description>Enable auto-revocation of keys.</description>
                            <value>0xC3965A5A</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Disabled</name>
                            <description>Disable auto-revocation of keys used to verify firmware.</description>
                            <value>0x47D13CA5</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>DGPREV</name>
                    <description>Configure the downgrade prevention policy.</description>
                    <addressOffset>0x0008</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>ENABLE</name>
                        <description>Possible values for this register</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The policy is not programmed, hence any existing policy
                  on downgrade prevention is unaltered.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Enabled</name>
                            <description>Enable downgrade protection on firmware update.
                  If Enabled, the SICR.UROT.SM.TIMESTAMP register cannot be left
                  Unprogrammed.</description>
                            <value>0xC3965A5A</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Disabled</name>
                            <description>Disable downgrade protection on firmware updates.
                  If Disabled, the SICR.UROT.SM.TIMESTAMP register shall be left
                  Unprogrammed.</description>
                            <value>0x47D13CA5</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <dim>0x1D</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>RFU[%s]</name>
                    <description>Description collection: These registers are included when generating signature of the TBS content of SICR.</description>
                    <addressOffset>0x000C</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>RFU</name>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The register is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
              </cluster>
              <cluster>
                <name>SIGNATURE</name>
                <description>Signature on the manifest defined in SICR.UROT.SM.TBS</description>
                <headerStructName>SICR_UROT_RECOVERY_SM_SIGNATURE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x00F4</addressOffset>
                <register>
                  <name>ALG</name>
                  <description>The signature algorithm identifier as defined in RFC8152.</description>
                  <addressOffset>0x0000</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>ID</name>
                      <description>Algorithm identifier</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature algorithm identifier is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>AlgIdEd25519</name>
                          <description>ARM ADAC-defined identifier for Ed25519.
                   The use of ARM ADAC-defined identifier ensures consistent
                   user interface on CTRL-AP and SICR.
                   Only Ed25519 curve is supported.</description>
                          <value>0x00000005</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>SIZE</name>
                  <description>Size of the raw signature in bytes.</description>
                  <addressOffset>0x0004</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>SIZE</name>
                      <description>Signature size</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>SizeEd25519</name>
                          <description>Size of Ed25519 signature bytestring.</description>
                          <value>0x00000040</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>MaxSize</name>
                          <description>Currently, the secure domain ROM code supports only Ed25519 (and only Ed25519 curve) signature scheme,
                   and hence the MaxSize is the same as the Ed25519 signature
                   size.</description>
                          <value>0x00000040</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ADDR</name>
                  <description>Address of the signature on the firmware manifest.</description>
                  <addressOffset>0x0008</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>ADDR</name>
                      <description>Signature address.</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <cluster>
            <name>UPDATE</name>
            <description>Description of FW Updates, if any.
        In case, SICR.UROT.TBS.POLICY.UPDATE is set to Disabled,
        these registers are ignored by the secure domain ROM code.</description>
            <headerStructName>SICR_UROT_UPDATE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0200</addressOffset>
            <register>
              <name>OPERATION</name>
              <description>Command from the secure domain firmware to the secure domain ROM code.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-write</access>
              <fields>
                <field>
                  <name>OPCODE</name>
                  <description>Opcode to identify the command.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Nop</name>
                      <description>No operation pending.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTVerify</name>
                      <description>This commands allows the firmware update to just be
                verified without applying it.</description>
                      <value>0x80000001</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTActivate</name>
                      <description>This indicates the firmware update shall be (verified and)
                applied.</description>
                      <value>0x80000002</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTConfirm</name>
                      <description>The update image is expected to set this operation to
                indicate it booted correctly.</description>
                      <value>0x8F9AC403</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RecoveryVerify</name>
                      <description>This commands allows the firmware update to just be
                verified without applying it.</description>
                      <value>0x80000003</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RecoveryActivate</name>
                      <description>This indicates the firmware update shall be (verified and)
                applied.</description>
                      <value>0x80000004</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RecoveryConfirm</name>
                      <description>The update image is expected to set this operation to
                indicate it booted correctly.</description>
                      <value>0xC4038F9A</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>AROTRecovery</name>
                      <description>Instructs the ROM code to boot the recovery image in safe mode
                to download a AROT image instead of a UROT image.</description>
                      <value>0xA0000001</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>ROM code indicates the status of update to the secure
            domain firmware via this register.</description>
              <addressOffset>0x0004</addressOffset>
              <access>read-write</access>
              <fields>
                <field>
                  <name>CODE</name>
                  <description>Status code.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>None</name>
                      <description>No operation pending to indicate any status.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UnknownOperation</name>
                      <description>Unknown OPCODE in SICR.UROT.UPDATE.OPERATION.</description>
                      <value>0xF0000001</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>InvalidManifest</name>
                      <description>The information in the manifest is invalid.</description>
                      <value>0xF0000002</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>InvalidSignature</name>
                      <description>The signature did not verify.</description>
                      <value>0xF0000003</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UnknownPubKey</name>
                      <description>The public key in SICR.UROT.UPDATE.SM.TBS.PUBKEY is unknown.</description>
                      <value>0xF0000004</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RevokedPubKey</name>
                      <description>The public key used to signature is already revoked on the device.</description>
                      <value>0xF0000005</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>StaleFW</name>
                      <description>The timestamp on the firmware is older than the current one.</description>
                      <value>0xF0000006</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>VerifyOK</name>
                      <description>Signature verification is successful.</description>
                      <value>0xF0000007</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>InvalidLayout</name>
                      <description>The firmware update is built for the wrong layout.
                Any update that overwrites the existing firmware is disallowed.</description>
                      <value>0xF0000008</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTUnconfirmed</name>
                      <description>The firmware update is applied, but is pending confirmation
                 from the updated firmware.</description>
                      <value>0xF0000009</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RecoveryUnconfirmed</name>
                      <description>The firmware update is applied, but is pending confirmation
                 from the updated firmware.</description>
                      <value>0xF000000A</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Reverted</name>
                      <description>The secure domain ROM code reverted the update as the update is not confirmed.</description>
                      <value>0xF000000B</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SafeMode</name>
                      <description>Recovery image is booted in safe mode as the firmware update failed
                and the ROM could not restore the previous UROT firmware.</description>
                      <value>0xF000000C</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>AROTRecovery</name>
                      <description>Recovery image is booted so that the recovery image can download a
                AROT image that ROM does not verify.</description>
                      <value>0xF000000D</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTUpdateDisabled</name>
                      <description>No valid recovery image is present and hence UROT firmware update is disabled.</description>
                      <value>0xF000000E</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
