adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
                  <register>
                    <name>DGPREV</name>
                    <description>Configure the downgrade prevention policy.</description>
                    <addressOffset>0x0008</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>ENABLE</name>
                        <description>Possible values for this register</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The policy is not programmed, hence any existing policy
                  on downgrade prevention is unaltered.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Enabled</name>
                            <description>Enable downgrade protection on firmware update.
                  If Enabled, the SICR.UROT.SM.TIMESTAMP register cannot be left
                  Unprogrammed.</description>
                            <value>0xC3965A5A</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Disabled</name>
                            <description>Disable downgrade protection on firmware updates.
                  If Disabled, the SICR.UROT.SM.TIMESTAMP register shall be left
                  Unprogrammed.</description>
                            <value>0x47D13CA5</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <dim>0x1D</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>RFU[%s]</name>
                    <description>Description collection: These registers are included when generating signature of the TBS content of SICR.</description>
                    <addressOffset>0x000C</addressOffset>
                    <access>read-write</access>
                    <fields>
                      <field>
                        <name>RFU</name>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The register is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
              </cluster>
              <cluster>
                <name>SIGNATURE</name>
                <description>Signature on the manifest defined in SICR.UROT.SM.TBS</description>
                <headerStructName>SICR_UROT_UPDATE_SM_SIGNATURE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x00F4</addressOffset>
                <register>
                  <name>ALG</name>
                  <description>The signature algorithm identifier as defined in RFC8152.</description>
                  <addressOffset>0x0000</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>ID</name>
                      <description>Algorithm identifier</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature algorithm identifier is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>AlgIdEd25519</name>
                          <description>ARM ADAC-defined identifier for Ed25519.
                   The use of ARM ADAC-defined identifier ensures consistent
                   user interface on CTRL-AP and SICR.
                   Only Ed25519 curve is supported.</description>
                          <value>0x00000005</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>SIZE</name>
                  <description>Size of the raw signature in bytes.</description>
                  <addressOffset>0x0004</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>SIZE</name>
                      <description>Signature size</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>SizeEd25519</name>
                          <description>Size of Ed25519 signature bytestring.</description>
                          <value>0x00000040</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>MaxSize</name>
                          <description>Currently, the secure domain ROM code supports only Ed25519 (and only Ed25519 curve) signature scheme,
                   and hence the MaxSize is the same as the Ed25519 signature
                   size.</description>
                          <value>0x00000040</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ADDR</name>
                  <description>Address of the signature on the firmware manifest.</description>
                  <addressOffset>0x0008</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>ADDR</name>
                      <description>Signature address.</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <register>
            <dim>0x400</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CERTIFICATE[%s]</name>
            <description>Description collection: Device X.509 certificate.</description>
            <addressOffset>0x0320</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CERT</name>
                <description>Device certificate.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>AROT</name>
          <description>Interface used by the secure domain firmware to extend the RoT to the
      other local domains and store information on configuration of debug
      access ports, CTRL-AP methods, and other platfrom security related
      configurations per domain.
      These registers are only accessed the secure domain firmware.
      Any operations related to the local domains must be requested
      via the secure domain firmware API.</description>
          <headerStructName>SICR_AROT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1500</addressOffset>
          <cluster>
            <name>SECURE</name>
            <description>Any next-stage secure domain firmware related.</description>
            <headerStructName>SICR_AROT_SECURE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0000</addressOffset>
            <register>
              <name>TBD</name>
              <description>To be added once the secure domain ROM-related interface is agreed.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-only</access>
            </register>
          </cluster>
          <cluster>
            <name>APPLICATION</name>
            <description>Extended RoT to the application core/domain.</description>
            <headerStructName>SICR_AROT_APPLICATION</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0400</addressOffset>
            <register>
              <name>TBD</name>
              <description>To be added once the secure domain ROM-related interface is agreed.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-only</access>
            </register>
          </cluster>
          <cluster>
            <name>RADIO</name>
            <description>Interface to extend the RoT to the radio core/domain.</description>
            <headerStructName>SICR_AROT_RADIO</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0800</addressOffset>
            <register>
              <name>TBD</name>
              <description>To be added once the secure domain ROM-related interface is agreed.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-only</access>
            </register>
          </cluster>
          <cluster>
            <name>CELLULARCORE</name>
            <description>Interface to extend the RoT to the cellular core/domain.</description>
            <headerStructName>SICR_AROT_CELLULARCORE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0C00</addressOffset>
            <register>
              <name>TBD</name>
              <description>To be added once the secure domain ROM-related interface is agreed.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-only</access>
            </register>
          </cluster>
        </cluster>
