adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
              <cluster>
                <name>SIGNATURE</name>
                <description>Signature on the manifest defined in SICR.UROT.SM.TBS</description>
                <headerStructName>RICR_UROT_RECOVERY_SM_SIGNATURE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x00F4</addressOffset>
                <register>
                  <name>ALG</name>
                  <description>The signature algorithm identifier as defined in RFC8152.</description>
                  <addressOffset>0x0000</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>ID</name>
                      <description>Algorithm identifier</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature algorithm identifier is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>AlgIdEd25519</name>
                          <description>ARM ADAC-defined identifier for Ed25519.
                   The use of ARM ADAC-defined identifier ensures consistent
                   user interface on CTRL-AP and SICR.
                   Only Ed25519 curve is supported.</description>
                          <value>0x00000005</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>SIZE</name>
                  <description>Size of the raw signature in bytes.</description>
                  <addressOffset>0x0004</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>SIZE</name>
                      <description>Signature size</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>SizeEd25519</name>
                          <description>Size of Ed25519 signature bytestring.</description>
                          <value>0x00000040</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>MaxSize</name>
                          <description>Currently, the secure domain ROM code supports only Ed25519 (and only Ed25519 curve) signature scheme,
                   and hence the MaxSize is the same as the Ed25519 signature
                   size.</description>
                          <value>0x00000040</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ADDR</name>
                  <description>Address of the signature on the firmware manifest.</description>
                  <addressOffset>0x0008</addressOffset>
                  <access>read-write</access>
                  <fields>
                    <field>
                      <name>ADDR</name>
                      <description>Signature address.</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprogrammed</name>
                          <description>The signature is not programmed.</description>
                          <value>0xFFFFFFFF</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <cluster>
            <name>UPDATE</name>
            <description>Internal information maintained by the secure domain ROM code on the
          state of update.</description>
            <headerStructName>RICR_UROT_UPDATE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0200</addressOffset>
            <register>
              <name>STATUS</name>
              <description>ROM code maintains the status of update here.</description>
              <addressOffset>0x0000</addressOffset>
              <access>read-write</access>
              <fields>
                <field>
                  <name>CODE</name>
                  <description>Status code.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>None</name>
                      <description>No operation pending to indicate any status.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTUnconfirmed</name>
                      <description>The firmware update is applied, but is pending confirmation
                 from the updated firmware.</description>
                      <value>0xF0000009</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RecoveryUnconfirmed</name>
                      <description>The firmware update is applied, but is pending confirmation
                 from the updated firmware.</description>
                      <value>0xF000000A</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SafeMode</name>
                      <description>Recovery image is booted in safe mode as the UROT firmware update
                failed and the ROM could not restore any previous UROT firmware.</description>
                      <value>0xF000000C</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>AROTRecovery</name>
                      <description>Recovery image is booted so that the recovery image can download a
                AROT image that ROM does not verify.</description>
                      <value>0xF000000D</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UROTUpdateDisabled</name>
                      <description>No valid recovery image is present and hence UROT firmware update is disabled.</description>
                      <value>0xF000000E</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
