adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_FICR_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x100</addressOffset>
          <cluster>
            <name>SYSCTRL</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0</addressOffset>
            <cluster>
              <name>FLL16M</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_FLL16M</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_FLL16M_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>RCOARSE</name>
                  <description>Trim value for SYSCTRL.FLL16M.RCOARSE</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>RFINE</name>
                  <description>Trim value for SYSCTRL.FLL16M.RFINE</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for SYSCTRL.FLL16M.TCOEF</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SYSCTRL.FLL16M.VSUP</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>CKSW16MTRIM</name>
                  <description>Trim value for SYSCTRL.FLL16M.CKSW16MTRIM</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>LFRC</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_LFRC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x14</addressOffset>
              <cluster>
                <name>CAL</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_LFRC_CAL</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>LFRCOSCTRIM</name>
                  <description>Trim value for SYSCTRL.LFRC.LFRCOSCTRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>LFXO</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_LFXO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x18</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_LFXO_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>PDLOWERTHR</name>
                  <description>Trim value for SYSCTRL.LFXO.PDLOWERTHR</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PDUPPERTHR</name>
                  <description>Trim value for SYSCTRL.LFXO.PDUPPERTHR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BIAS</name>
                  <description>Trim value for SYSCTRL.LFXO.BIAS</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PIXO</name>
                  <description>Trim value for SYSCTRL.LFXO.PIXO</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TRIMBUS</name>
                  <description>Trim value for SYSCTRL.LFXO.TRIMBUS</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>HFXO</name>
              <description>Unspecified</description>
              <headerStructName>HFXO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x38</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>HFXO_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>AREG</name>
                  <description>Trim value for SYSCTRL.HFXO.AREG</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>IBIAS</name>
                  <description>Trim value for SYSCTRL.HFXO.IBIAS</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PIXO</name>
                  <description>Trim value for SYSCTRL.HFXO.PIXO</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PDTHR</name>
                  <description>Trim value for SYSCTRL.HFXO.PDTHR</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VREF</name>
                  <description>Trim value for SYSCTRL.HFXO.VREF</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>MULT2</name>
                  <description>Trim value for SYSCTRL.HFXO.MULT2</description>
                  <addressOffset>0x14</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <register>
                <name>CLOAD</name>
                <description>Trim value for SYSCTRL.HFXO.CLOAD</description>
                <addressOffset>0x18</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>AMPLITUDECTRL</name>
                <description>Trim value for SYSCTRL.HFXO.AMPLITUDECTRL (AREG_VOLT)</description>
                <addressOffset>0x1C</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>AUDIOPLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_AUDIOPLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x58</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_AUDIOPLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>CTUNE</name>
                  <description>Trim value for SYSCTRL.AUDIOPLL.CTUNE</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>USBHSPLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_USBHSPLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x5C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_USBHSPLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>CTUNE</name>
                  <description>Trim value for SYSCTRL.USBHSPLL.CTUNE</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MBIAS</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_MBIAS</headerStructName>
              <access>read-write</access>
              <addressOffset>0x60</addressOffset>
              <cluster>
                <name>CONFIG</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_MBIAS_CONFIG</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>CFG</name>
                  <description>Trim value for SYSCTRL.MBIAS.CFG</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_MBIAS_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x4</addressOffset>
                <register>
                  <name>MBIASIBPP</name>
                  <description>Trim value for SYSCTRL.MBIAS.MBIASIBPP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>MBIASIBPSR</name>
                  <description>Trim value for SYSCTRL.MBIAS.MBIASIBPSR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>OSCRFR</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_OSCRFR</headerStructName>
              <access>read-write</access>
              <addressOffset>0x6C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_OSCRFR_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>OSC</name>
                  <description>Trim value for SYSCTRL.OSCRFR.OSC</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>IBPSR</name>
                  <description>Trim value for SYSCTRL.OSCRFR.IBPSR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREG1V0</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_VREG1V0</headerStructName>
              <access>read-write</access>
              <addressOffset>0x74</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_VREG1V0_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>IREF</name>
                  <description>Trim value for SYSCTRL.VREG1V0.IREF</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>HIGHPOWER</name>
                  <description>Trim value for SYSCTRL.VREG1V0.HIGHPOWER</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
