adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
            <cluster>
              <name>MEMCONF130</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_MEMCONF130</headerStructName>
              <access>read-write</access>
              <addressOffset>0x278</addressOffset>
              <cluster>
                <dim>2</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SYSCTRL_MEMCONF130_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for SYSCTRL.MEMCONF130.TRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <cluster>
            <name>GLOBAL</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_GLOBAL</headerStructName>
            <access>read-write</access>
            <addressOffset>0x280</addressOffset>
            <cluster>
              <name>SAADC</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_GLOBAL_SAADC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <register>
                <name>CALVREF</name>
                <description>Trim value for GLOBAL.SAADC.CALVREF</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x3</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>CALGAIN[%s]</name>
                <description>Description collection: Trim value for GLOBAL.SAADC.CALGAIN</description>
                <addressOffset>0x4</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>CALOFFSET</name>
                <description>Trim value for GLOBAL.SAADC.CALOFFSET</description>
                <addressOffset>0x10</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x6</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>LINCALCOEFF[%s]</name>
                <description>Description collection: Trim value for GLOBAL.SAADC.LINCALCOEFF</description>
                <addressOffset>0x14</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>CALIREF</name>
                <description>Trim value for GLOBAL.SAADC.CALIREF</description>
                <addressOffset>0x2C</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>TEMP</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_GLOBAL_TEMP</headerStructName>
              <access>read-write</access>
              <addressOffset>0x30</addressOffset>
              <register>
                <name>CALIB</name>
                <description>Trim value for GLOBAL.TEMP.CALIB</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x6</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>A[%s]</name>
                <description>Description collection: Trim value for GLOBAL.TEMP.A</description>
                <addressOffset>0x4</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x6</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>B[%s]</name>
                <description>Description collection: Trim value for GLOBAL.TEMP.B</description>
                <addressOffset>0x1C</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x5</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>T[%s]</name>
                <description>Description collection: Trim value for GLOBAL.TEMP.T</description>
                <addressOffset>0x34</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>NFCT</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_GLOBAL_NFCT</headerStructName>
              <access>read-write</access>
              <addressOffset>0x78</addressOffset>
              <register>
                <name>BIASCFG</name>
                <description>Trim value for NFCT.BIASCFG</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>CANPLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_GLOBAL_CANPLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x7C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_GLOBAL_CANPLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>CTUNE</name>
                  <description>Trim value for GLOBAL.CANPLL.CTUNE</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>GPIO</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_GLOBAL_GPIO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x80</addressOffset>
              <cluster>
                <name>PORTCNF</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_GLOBAL_GPIO_PORTCNF</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <cluster>
                  <name>DRIVECTRL</name>
                  <description>Unspecified</description>
                  <headerStructName>GLOBAL_FICR_TRIM_GLOBAL_GPIO_PORTCNF_DRIVECTRL</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0</addressOffset>
                  <register>
                    <dim>0x2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>P[%s]</name>
                    <description>Description collection: Trim value for GPIO.Pn.PORTCNF.DRIVECTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>Trim value</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                      </field>
                    </fields>
                  </register>
                </cluster>
              </cluster>
            </cluster>
            <cluster>
              <name>COMP</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_GLOBAL_COMP</headerStructName>
              <access>read-write</access>
              <addressOffset>0x88</addressOffset>
              <register>
                <name>REFTRIM</name>
                <description>Trim value for GLOBAL.COMP.REFTRIM</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>RCAL80KCOARSE</name>
                <description>Trim value for GLOBAL.COMP.RCAL80KCOARSE</description>
                <addressOffset>0x4</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>RCAL80KFINE</name>
                <description>Trim value for GLOBAL.COMP.RCAL80KFINE</description>
                <addressOffset>0x8</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>RCAL6M4COARSE</name>
                <description>Trim value for GLOBAL.COMP.RCAL6M4COARSE</description>
                <addressOffset>0xC</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>RCAL6M4FINE</name>
                <description>Trim value for GLOBAL.COMP.RCAL6M4FINE</description>
                <addressOffset>0x10</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>APPLICATION</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_APPLICATION</headerStructName>
            <access>read-write</access>
            <addressOffset>0x31C</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_APPLICATION_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_APPLICATION_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for APPLICATION.HSFLL.VSUP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for APPLICATION.HSFLL.COARSE</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for APPLICATION.HSFLL.FINE</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_APPLICATION_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x34</addressOffset>
              <cluster>
                <dim>3</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for APPLICATION.MEMCONF.TRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <cluster>
            <name>RADIOCORE</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_RADIOCORE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x35C</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_RADIOCORE_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_RADIOCORE_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for RADIOCORE.HSFLL.VSUP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for RADIOCORE.HSFLL.COARSE</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for RADIOCORE.HSFLL.FINE</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_RADIOCORE_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x34</addressOffset>
              <cluster>
                <dim>3</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for RADIOCORE.MEMCONF.TRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
