adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
            <cluster>
              <name>RADIO</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_RADIOCORE_RADIO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x40</addressOffset>
              <cluster>
                <name>SPHYNXANA</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>FSCTRL1</name>
                  <description>Trim value for RADIOCORE.RADIO.FSCTRL1</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>FSCTRL2</name>
                  <description>Trim value for RADIOCORE.RADIO.FSCTRL2</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>RXCTRL</name>
                  <description>Trim value for RADIOCORE.RADIO.RXCTRL</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TXCTRL</name>
                  <description>Trim value for RADIOCORE.RADIO.TXCTRL</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>OVRRXTRIMCODE</name>
                  <description>Trim value for RADIOCORE.RADIO.OVRRXTRIMCODE</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <register>
                <name>RSSIOFFSET</name>
                <description>Trim value for RSSI offset compensation</description>
                <addressOffset>0x14</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>EDCAL</name>
                <description>Trim value for EDCAL</description>
                <addressOffset>0x18</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>BOOT</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_BOOT</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3E0</addressOffset>
            <cluster>
              <name>HSFLL120</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_BOOT_HSFLL120</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <name>VSUP</name>
                <description>Trim value for SYSCTRL.HSFLL120.VSUP</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>COARSE</name>
                <description>Trim value for SYSCTRL.HSFLL120.COARSE</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>FINE</name>
                <description>Trim value for SYSCTRL.HSFLL120.FINE</description>
                <addressOffset>0x008</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>OTPC</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_BOOT_OTPC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x00C</addressOffset>
              <register>
                <name>WAITSTATES</name>
                <description>OTPC waitstates trim when running with TRIM.BOOT.HSFLL120 trims</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>WAITSTATES</name>
                    <description>Waitstates</description>
                    <lsb>0</lsb>
                    <msb>6</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>FREQUENCY</name>
                <description>OTPC frequency tim when running with TRIM.BOOT.HSFLL120 trims</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>FREQUENCY</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>COMMON</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_COMMON</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3F4</addressOffset>
            <register>
              <name>FFFF</name>
              <description>Value to be written to multibit MIRROR register in MMIs (MIRROR=1)</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>FFFF</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ZERO</name>
              <description>Value to be written to MIRROR register in MMIs (MIRROR=0)</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>ZERO</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ONE</name>
              <description>Value to be written to MIRROR register in MMIs (MIRROR=1)</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>ONE</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>SECURE</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_FICR_TRIM_SECURE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x400</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SECURE_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SECURE_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SECURE.HSFLL.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL.FINE</description>
                  <addressOffset>0x01C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>HSFLL200</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SECURE_HSFLL200</headerStructName>
              <access>read-write</access>
              <addressOffset>0x034</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SECURE_HSFLL200_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SECURE.HSFLL200.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL200.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL200.FINE</description>
                  <addressOffset>0x014</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SECURE_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x058</addressOffset>
              <cluster>
                <dim>7</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for SECURE.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF200</name>
              <description>Unspecified</description>
              <headerStructName>GLOBAL_FICR_TRIM_SECURE_MEMCONF200</headerStructName>
              <access>read-write</access>
              <addressOffset>0x074</addressOffset>
              <cluster>
                <name>BLOCKTYPE</name>
                <description>Unspecified</description>
                <headerStructName>GLOBAL_FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Trim value for SECURE.MEMCONF200.TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
        </cluster>
        <cluster>
          <name>BOOT</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_FICR_BOOT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x5A0</addressOffset>
          <register>
            <name>SIZE</name>
            <description>Size of DATA group</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Number of trim values stored in DATA.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x80</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Compressed address and data pointer.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>REGOFFSET</name>
                <description>Address offset to trim register</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DATAPOINTER</name>
                <description>Pointer to location in TRIM group</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SRAM</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_FICR_SRAM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x7B0</addressOffset>
          <register>
            <name>REPAIR0</name>
            <description>SRAM repair register 0</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0109</name>
                <description>GD RamController01 Ram 9</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0108</name>
                <description>GD RamController01 Ram 8</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0107</name>
                <description>GD RamController01 Ram 7</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0106</name>
                <description>GD RamController01 Ram 6</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR1</name>
            <description>SRAM repair register 1</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0105</name>
                <description>GD RamController01 Ram 5</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0104</name>
                <description>GD RamController01 Ram 4</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0103</name>
                <description>GD RamController01 Ram 3</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0102</name>
                <description>GD RamController01 Ram 2</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
