adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
        <register>
          <name>GRXSTSR</name>
          <description>Receive Status Debug Read Register</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNUM</name>
              <description>Channel Number (ChNum)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHEP0</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP1</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP2</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP3</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP4</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP5</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP6</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP7</name>
                  <description>Unspecified</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP8</name>
                  <description>Unspecified</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP9</name>
                  <description>Unspecified</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP10</name>
                  <description>Unspecified</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP11</name>
                  <description>Unspecified</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP12</name>
                  <description>Unspecified</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP13</name>
                  <description>Unspecified</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP14</name>
                  <description>Unspecified</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP15</name>
                  <description>Unspecified</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCNT</name>
              <description>Byte Count (BCnt)</description>
              <lsb>4</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID (DPID)</description>
              <lsb>15</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA2</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDATA</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKTSTS</name>
              <description>Packet Status (PktSts) indicates the status of the received packet.</description>
              <lsb>17</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTNAK</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INOUTDPRX</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INOUTTRCOM</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSETUPCOM</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTTOG</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSETUPRX</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHHALT</name>
                  <description>Unspecified</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FN</name>
              <description>Mode: Device only. Frame Number (FN)</description>
              <lsb>21</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRXSTSP</name>
          <description>Receive Status Read/Pop Register</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNUM</name>
              <description>Channel Number (ChNum)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHEP0</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP1</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP2</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP3</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP4</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP5</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP6</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP7</name>
                  <description>Unspecified</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP8</name>
                  <description>Unspecified</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP9</name>
                  <description>Unspecified</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP10</name>
                  <description>Unspecified</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP11</name>
                  <description>Unspecified</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP12</name>
                  <description>Unspecified</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP13</name>
                  <description>Unspecified</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP14</name>
                  <description>Unspecified</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHEP15</name>
                  <description>Unspecified</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCNT</name>
              <description>Byte Count (BCnt)</description>
              <lsb>4</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID (DPID)</description>
              <lsb>15</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA2</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDATA</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKTSTS</name>
              <description>Packet Status (PktSts) indicates the status of the received packet.</description>
              <lsb>17</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTNAK</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INOUTDPRX</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INOUTTRCOM</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSETUPCOM</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTTOG</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FN</name>
              <description>Mode: Device only. Frame Number (FN)</description>
              <lsb>21</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRXFSIZ</name>
          <description>Receive FIFO Size Register</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000224</resetValue>
          <fields>
            <field>
              <name>RXFDEP</name>
              <description>Mode: Host and Device. RxFIFO Depth (RxFDep)</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GNPTXFSIZ</name>
          <description>Non-periodic Transmit FIFO Size Register</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x02000224</resetValue>
          <fields>
            <field>
              <name>NPTXFSTADDR</name>
              <description>Non-periodic Transmit RAM Start Address (NPTxFStAddr)</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>NPTXFDEP</name>
              <description>Mode: Host only. Non-periodic TxFIFO Depth (NPTxFDep)</description>
              <lsb>16</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GNPTXSTS</name>
          <description>Non-periodic Transmit FIFO/Queue Status Register</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00080200</resetValue>
          <fields>
            <field>
              <name>NPTXFSPCAVAIL</name>
              <description>Non-periodic TxFIFO Space Avail (NPTxFSpcAvail)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>NPTXQSPCAVAIL</name>
              <description>Non-periodic Transmit Request Queue Space Available (NPTxQSpcAvail)</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Unspecified</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE1</name>
                  <description>Unspecified</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE2</name>
                  <description>Unspecified</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE3</name>
                  <description>Unspecified</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE4</name>
                  <description>Unspecified</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE5</name>
                  <description>Unspecified</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE6</name>
                  <description>Unspecified</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE7</name>
                  <description>Unspecified</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUE8</name>
                  <description>Unspecified</description>
                  <value>0x08</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPTXQTOP</name>
              <description>Top of the Non-periodic Transmit Request Queue (NPTxQTop)</description>
              <lsb>24</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INOUTTK</name>
                  <description>Unspecified</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZEROTX</name>
                  <description>Unspecified</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINGCSPLIT</name>
                  <description>Unspecified</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHNHALT</name>
                  <description>Unspecified</description>
                  <value>0x03</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GGPIO</name>
          <description>General Purpose Input/Output Register</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPI</name>
              <description>General Purpose Input (GPI)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPO</name>
              <description>General Purpose Output (GPO)</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GUID</name>
          <description>User ID Register</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0x12345678</resetValue>
          <fields>
            <field>
              <name>GUID</name>
              <description>User ID (UserID)</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GSNPSID</name>
          <description>Synopsys ID Register</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x4F54400A</resetValue>
          <fields>
            <field>
              <name>SYNOPSYSID</name>
              <description>Release number of the controller being used currently.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GHWCFG1</name>
          <description>User Hardware Configuration 1 Register</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0xAA555000</resetValue>
          <fields>
            <field>
              <name>EPDIR</name>
              <description>This 32-bit field uses two bits per</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
