adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
          <register>
            <name>QUEUESIZECAPABILITY</name>
            <description>This register reflects the configured size of the Data Buffer and Queues in DWC_mipi_i3c.</description>
            <addressOffset>0x0E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00022355</resetValue>
            <fields>
              <field>
                <name>TXBUFSIZE</name>
                <description>Transmit Data Buffer Size</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2DWORD</name>
                    <description>2 DWORDS</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4DWORD</name>
                    <description>4 DWORDS</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8DWORD</name>
                    <description>8 DWORDS</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16DWORD</name>
                    <description>16 DWORDS</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32DWORD</name>
                    <description>32 DWORDS</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64DWORD</name>
                    <description>64 DWORDS</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXBUFSIZE</name>
                <description>Receive Data Buffer Size</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2DWORD</name>
                    <description>2 DWORDS</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4DWORD</name>
                    <description>4 DWORDS</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8DWORD</name>
                    <description>8 DWORDS</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16DWORD</name>
                    <description>16 DWORDS</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32DWORD</name>
                    <description>32 DWORDS</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64DWORD</name>
                    <description>64 DWORDS</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMDBUFSIZE</name>
                <description>Command Queue Size</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2DWORD</name>
                    <description>2 DWORDS</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4DWORD</name>
                    <description>4 DWORDS</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8DWORD</name>
                    <description>8 DWORDS</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16DWORD</name>
                    <description>16 DWORDS</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESPBUFSIZE</name>
                <description>Response Queue Size</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2DWORD</name>
                    <description>2 DWORDS</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4DWORD</name>
                    <description>4 DWORDS</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8DWORD</name>
                    <description>8 DWORDS</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16DWORD</name>
                    <description>16 DWORDS</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IBIBUFSIZE</name>
                <description>IBI Queue Size</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2DWORD</name>
                    <description>2 DWORDS</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4DWORD</name>
                    <description>4 DWORDS</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8DWORD</name>
                    <description>8 DWORDS</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16DWORD</name>
                    <description>16 DWORDS</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>10</dim>
            <dimIncrement>0x010</dimIncrement>
            <name>DEVCHARTABLE[%s]</name>
            <description>Unspecified</description>
            <headerStructName>DEVCHARTABLE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x200</addressOffset>
            <register>
              <name>LOC1</name>
              <description>Description cluster: Device Characteristic Table Location-1 of Device [n]</description>
              <addressOffset>0x0</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>LSBPROVISIONALID</name>
                  <description>The LSB 32-bit value of Provisional-ID</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>LOC2</name>
              <description>Description cluster: Device Characteristic Table Location-2 of Device [n]</description>
              <addressOffset>0x4</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>MSBPROVISIONALID</name>
                  <description>The MSB 16-bit value of Provisional-ID</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>LOC3</name>
              <description>Description cluster: Device Characteristic Table Location-3 of Device [n]</description>
              <addressOffset>0x8</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>DCR</name>
                  <description>Device Characteristic Value</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>BCR</name>
                  <description>Bus Characteristic Value</description>
                  <lsb>8</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>LOC4</name>
              <description>Description cluster: Device Characteristic Table Location-4 of Device [n]</description>
              <addressOffset>0xC</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>DEVDYNAMICADDR</name>
                  <description>Device Dynamic Address assigned.</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <dim>0x20</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>SECDEVCHARTABLE[%s]</name>
            <description>Description collection: Secondary Master Device Characteristic Table Location of Device [n]</description>
            <addressOffset>0x200</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DYNAMICADDR</name>
                <description>The Dynamic Addr of Device [n]</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DCRTYPE</name>
                <description>The DCR TYPE of Device [n]</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BCRTYPE</name>
                <description>The BCR TYPE of Device [n]</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATICADDR</name>
                <description>The Static Addr of Device [n]</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0xA</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DEVADDRTABLELOC[%s]</name>
            <description>Description collection: Device Address Table of Device [n]</description>
            <addressOffset>0x2C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DEVSTATICADDR</name>
                <description>Device Static Address.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DEVDYNAMICADDR</name>
                <description>Device Dynamic Address with parity.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DEVNACKRETRYCNT</name>
                <description>This field is used to set the Device NACK Retry count for the particular device.</description>
                <lsb>29</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>LEGACYI2CDEVICE</name>
                <description>Legacy I2C device or not.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>I3CCORE_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x900</addressOffset>
          <cluster>
            <name>CH0</name>
            <description>Unspecified</description>
            <headerStructName>I3CCORE_DMA_CH0</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>SAR0</name>
              <description>This register contains the source address of the DMA transfer.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>SAR</name>
                  <description>Current Source Address of DMA transfer.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DAR0</name>
              <description>This register contains the destination address of the DMA transfer.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>DAR</name>
                  <description>Current Destination address of DMA transfer.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
