adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_I3CCORE120_NS">
      <name>GLOBAL_I3CCORE121_NS</name>
      <description>I3CCORE 1</description>
      <baseAddress>0x2FBE1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="ICACHEDATA_S">
      <name>DCACHEDATA_S</name>
      <description>CACHEDATA 1</description>
      <baseAddress>0x31F00000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="ICACHEINFO_S">
      <name>DCACHEINFO_S</name>
      <description>CACHEINFO 1</description>
      <baseAddress>0x31F10000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral>
      <name>CRACENCORE_NS</name>
      <description>CRACENCORE 0</description>
      <baseAddress>0x41800000</baseAddress>
      <headerStructName>CRACENCORE</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CRACENCORE</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>CRYPTMSTRDMA</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_CRYPTMSTRDMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>FETCHADDRLSB</name>
            <description>Fetch Address Least Significant Bit</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FETCHADDRLSB</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FETCHADDRMSB</name>
            <description>Fetch Address Most Significant Bit</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FETCHADDRMSB</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FETCHLEN</name>
            <description>Fetch Length</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FETCHLEN</name>
                <lsb>0</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>FETCHCSTADDR</name>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>FETCHREALIGN</name>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>FETCHZPADDING</name>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FETCHTAG</name>
            <description>Fetch Tag</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FETCHTAG</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PUSHADDRLSB</name>
            <description>Push Address Least Significant Bit</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PUSHADDRLSB</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PUSHADDRMSB</name>
            <description>Push Address Most Significant Bit</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PUSHADDRMSB</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PUSHLEN</name>
            <description>Push Length</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PUSHLEN</name>
                <lsb>0</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>PUSHCSTADDR</name>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>PUSHREALIGN</name>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>PUSHDISCARD</name>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTEN</name>
            <description>Interrupt Enable</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>INTEN</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTENSET</name>
            <description>Interrupt Set</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>INTENSET</name>
                <lsb>0</lsb>
                <msb>5</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTENCLR</name>
            <description>Interrupt Clear</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>INTENCLR</name>
                <lsb>0</lsb>
                <msb>5</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTATRAW</name>
            <description>Interrupt Status Raw</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>INTSTATRAW</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTAT</name>
            <description>Interrupt Status</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>INTSTAT</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTATCLR</name>
            <description>Interrupt Status Clear</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>INTSTATCLR</name>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Configuration</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FETCHCTRLINDIRECT</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>PUSHCTRLINDIRECT</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FETCHSTOP</name>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PUSHSTOP</name>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>SOFTRST</name>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>START</name>
            <description>Start</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STARTFETCH</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>STARTPUSH</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FETCHBUSY</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PUSHBUSY</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FETCHNOTEMPTY</name>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PUSHWAITINGFIFO</name>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SOFTRSTBUSY</name>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PUSHNBDATA</name>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CRYPTMSTRHW</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_CRYPTMSTRHW</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>INCLIPSHWCFG</name>
            <description>Incuded IPs Hardware configuration</description>
            <addressOffset>0x00</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000771</resetValue>
            <fields>
              <field>
                <name>BA411AESINCLUDED</name>
                <description>Generic g_IncludeAES value.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA415HPAESGCMINCLUDED</name>
                <description>Generic g_IncludeAESGCM value.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA416HPAESXTSINCLUDED</name>
                <description>Generic g_IncludeAESXTS value.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA412DESINCLUDED</name>
                <description>Generic g_IncludeDES value.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA413HASHINCLUDED</name>
                <description>Generic g_IncludeHASH value.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA417CHACHAPOLYINCLUDED</name>
                <description>Generic g_IncludeChachaPoly value.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA418SHA3INCLUDED</name>
                <description>Generic g_IncludeSHA3  value.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA421ZUCINCLUDED</name>
                <description>Generic g_IncludeZUC  value.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA419SM4INCLUDED</name>
                <description>Generic g_IncludeSM4  value.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA414EPPKEINCLUDED</name>
                <description>Generic g_IncludePKE  value.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA431NDRNGINCLUDED</name>
                <description>Generic g_IncludeNDRNG  value.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA420HPCHACHAPOLYINCLUDED</name>
                <description>Generic g_IncludeHPChachaPoly  value.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA423SNOW3GINCLUDED</name>
                <description>Generic g_IncludeSnow3G  value.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA422KASUMIINCLUDED</name>
                <description>Generic g_IncludeKasumi  value.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA411EAESHWCFG1</name>
            <description>Generic g_AesModesPoss value.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x070301FF</resetValue>
            <fields>
              <field>
                <name>BA411EAESHWCFGMODE</name>
                <description>Generic g_AesModesPoss value.</description>
                <lsb>0</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA411EAESHWCFGCS</name>
                <description>Generic g_CS value.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA411EAESHWCFGMASKING</name>
                <description>Generic g_UseMasking value.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA411EAESHWCFGKEYSIZE</name>
                <description>Generic g_Keysize value.</description>
                <lsb>24</lsb>
                <msb>26</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA411EAESHWCFG2</name>
            <description>Generic g_CtrSize value.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000080</resetValue>
            <fields>
              <field>
                <name>BA411EAESHWCFG2</name>
                <description>Generic g_CtrSize value.</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA413HASHHWCFG</name>
            <description>Generic g_Hash value</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0003003F</resetValue>
            <fields>
              <field>
                <name>BA413HASHHWCFGMASK</name>
                <description>Generic g_HashMaskFunc value.</description>
                <lsb>0</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA413HASHHWCFGPADDING</name>
                <description>Generic g_HashPadding value.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA413HASHHWCFGHMAC</name>
                <description>Generic g_HMAC_enabled value.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA413HASHHWCFGVERIFYDIGEST</name>
                <description>Generic g_HashVerifyDigest value.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA418SHA3HWCFG</name>
            <description>Generic g_Sha3CtxtEn value.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>BA418SHA3HWCFG</name>
                <description>Generic g_Sha3CtxtEn value.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA419SM4HWCFG</name>
            <description>Generic g_SM4ModesPoss value.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x000201FF</resetValue>
            <fields>
              <field>
                <name>BA419SM4HWCFG</name>
                <description>Generic g_SM4ModesPoss value.</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>USEMASKING</name>
                <description>Generic g_sm4UseMasking value.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA424ARIAHWCFG</name>
            <description>Generic g_aria_modePoss value.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000017F</resetValue>
            <fields>
              <field>
                <name>BA424ARIAHWCFG</name>
                <description>Generic g_aria_modePoss value.</description>
                <lsb>0</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
