adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
        <register>
          <name>LSR</name>
          <description>Lock Status Register</description>
          <addressOffset>0xFB4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>SLI</name>
              <description>Software Lock Implemented. Indicates that a lock control mechanism is present from this interface</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>Indicates that a lock control mechanism is not present from this interface. Write operations to the LAR are ignored</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Indicates that a lock control mechanism present from this interface</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLK</name>
              <description>Software Lock Status. Returns the present lock status of the device, from the current interface</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Indicates that write operations are permitted from this interface</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Indicates that write operations are not permitted from this interface. Read operations are permitted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NTT</name>
              <description>Register size indicator. Always 0. Indicates that the LAR is implemented as 32-bit.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTHSTATUS</name>
          <description>Authentication Status Register</description>
          <addressOffset>0xFB8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>NSID</name>
              <description>Indicates the security level for Non-secure invasive debug</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Non-secure invasive debug disabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Non-secure invasive debug enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSNID</name>
              <description>Indicates the security level for Non-secure non-invasive debug</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Non-secure non-invasive debug disabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Non-secure non-invasive debug enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SID</name>
              <description>Always 0b00. Secure invasive debug is not implemented or is controlled elsewhere</description>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>SNID</name>
              <description>Always 0b00. The security level for Secure non-invasive debug is not implemented or is controlled elsewhere</description>
              <lsb>6</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVARCH</name>
          <description>Device Architecture register</description>
          <addressOffset>0xFBC</addressOffset>
          <access>read-only</access>
          <resetValue>0x47701A14</resetValue>
          <fields>
            <field>
              <name>Architecture</name>
              <description>Contains the CTI device architecture.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVID</name>
          <description>Device Configuration register</description>
          <addressOffset>0xFC8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00040800</resetValue>
          <fields>
            <field>
              <name>EXTMUXNUM</name>
              <description>Indicates the number of multiplexers available on Trigger Inputs and Trigger Outputs that are using asicctl.
                    The default value of 0b00000 indicates that no multiplexing is present. This value of this bit depends on the Verilog define EXTMUXNUM that you must change accordingly.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>NUMTRIG</name>
              <description>Number of ECT triggers available.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>NUMCH</name>
              <description>Number of ECT channels available.</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVTYPE</name>
          <description>Device Type Identifier register</description>
          <addressOffset>0xFCC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000014</resetValue>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>Major classification of the type of the debug component as specified in the Arm Architecture Specification for this
                    debug and trace component.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Controller</name>
                  <description>Indicates that this component allows a debugger to control other components in an Arm CoreSight SoC-400 system.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUB</name>
              <description>Sub-classification of the type of the debug component as specified in the Arm Architecture Specification within
                    the major classification as specified in the MAJOR field.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Crosstrigger</name>
                  <description>Indicates that this component is a sub-triggering component.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR4</name>
          <description>Peripheral ID4 Register</description>
          <addressOffset>0xFD0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>DES_2</name>
              <description>Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Code</name>
                  <description>JEDEC continuation code.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Always 0b0000. Indicates that the device only occupies 4KB of memory.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR5</name>
          <description>Peripheral ID5 register</description>
          <addressOffset>0xFD4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>PIDR6</name>
          <description>Peripheral ID6 register</description>
          <addressOffset>0xFD8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>PIDR7</name>
          <description>Peripheral ID7 register</description>
          <addressOffset>0xFDC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>PIDR0</name>
          <description>Peripheral ID0 Register</description>
          <addressOffset>0xFE0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000021</resetValue>
          <fields>
            <field>
              <name>PART_0</name>
              <description>Bits[7:0] of the 12-bit part number of the component. The designer of the component assigns this part number.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PartnumberL</name>
                  <description>Indicates bits[7:0] of the part number of the component.</description>
                  <value>0x21</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR1</name>
          <description>Peripheral ID1 Register</description>
          <addressOffset>0xFE4</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000BD</resetValue>
          <fields>
            <field>
              <name>PART_1</name>
              <description>Bits[11:8] of the 12-bit part number of the component. The designer of the component assigns this part number.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PartnumberH</name>
                  <description>Indicates bits[11:8] of the part number of the component.</description>
                  <value>0xD</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DES_0</name>
              <description>Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Arm</name>
                  <description>Arm. Bits[3:0] of the JEDEC JEP106 Identity Code</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR2</name>
          <description>Peripheral ID2 Register</description>
          <addressOffset>0xFE8</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>DES_1</name>
              <description>Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Arm</name>
                  <description>Arm. Bits[6:4] of the JEDEC JEP106 Identity Code</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JEDEC</name>
              <description>Always 1. Indicates that the JEDEC-assigned designer ID is used.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>REVISION</name>
              <description>Peripheral revision</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Rev0p0</name>
                  <description>This device is at r0p0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR3</name>
          <description>Peripheral ID3 Register</description>
          <addressOffset>0xFEC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMOD</name>
              <description>Customer Modified. Indicates whether the customer has modified the behavior of the component. In most cases,
                    this field is 0b0000. Customers change this value when they make authorized modifications to this component.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unmodified</name>
                  <description>Indicates that the customer has not modified this component.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVAND</name>
              <description>Indicates minor errata fixes specific to the revision of the component being used, for example metal fixes after
                    implementation. In most cases, this field is 0b0000. Arm recommends that the component designers ensure that a
                    metal fix can change this field if required, for example, by driving it from registers that reset to 0b0000.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoErrata</name>
                  <description>Indicates that there are no errata fixes to this component.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR0</name>
          <description>Component ID0 Register</description>
          <addressOffset>0xFF0</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>Preamble[0]. Contains bits[7:0] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Value</name>
                  <description>Bits[7:0] of the identification code.</description>
                  <value>0x0D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR1</name>
          <description>Component ID1 Register</description>
          <addressOffset>0xFF4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000090</resetValue>
          <fields>
            <field>
              <name>PRMBL_1</name>
              <description>Preamble[1]. Contains bits[11:8] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Value</name>
                  <description>Bits[11:8] of the identification code.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLASS</name>
              <description>Class of the component, for example, whether the component is a ROM table or a generic CoreSight component.
                    Contains bits[15:12] of the component identification code</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Coresight</name>
                  <description>Indicates that the component is a CoreSight component.</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR2</name>
          <description>Component ID2 Register</description>
          <addressOffset>0xFF8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>Preamble[2]. Contains bits[23:16] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Value</name>
                  <description>Bits[23:16] of the identification code.</description>
                  <value>0x05</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR3</name>
          <description>Component ID3 Register</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>Preamble[3]. Contains bits[31:24] of the component identification code.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Value</name>
                  <description>Bits[31:24] of the identification code.</description>
                  <value>0xB1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
