adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
          <register>
            <name>WRITES</name>
            <description>Number of writes for cache region.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>WRITES</name>
                <description>Number of writes for cache region.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DEBUGLOCK</name>
          <description>Lock debug mode.</description>
          <addressOffset>0x430</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DEBUGLOCK</name>
              <description>Lock debug mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Debug mode unlocked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Debug mode locked. Ignores any other value written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITELOCK</name>
          <description>Lock cache updates.</description>
          <addressOffset>0x434</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRITELOCK</name>
              <description>Lock cache updates</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Cache updates unlocked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Cache updates locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>VCACHEOWNER[%s]</name>
          <description>Description collection: Cache owners for the virtual cache regions.</description>
          <addressOffset>0x438</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Num</name>
              <description>Owner [n] is mapped to this VCACHE region.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFETCHCONFIG</name>
          <description>Prefetch Policy.</description>
          <addressOffset>0x478</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Prefetch size</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>NEWLINE</name>
              <description>Allow speculative prefetch continue onto a new line.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Speculative prefetch continue onto a new line is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Speculative prefetch continue onto a new line is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE2</name>
              <description>Prefetch size 2</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>NEWLINE2</name>
              <description>Allow speculative prefetch continue onto a new line.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Speculative prefetch continue onto a new line is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Speculative prefetch continue onto a new line is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="ICACHE_S">
      <name>DCACHE_S</name>
      <description>Cache 1</description>
      <baseAddress>0xE0083000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral>
      <name>SPU000_S</name>
      <description>System protection unit 0</description>
      <baseAddress>0x51000000</baseAddress>
      <headerStructName>SPU</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPU000</name>
        <value>0</value>
      </interrupt>
      <groupName>SPU</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>EVENTS_PERIPHACCERR</name>
          <description>A security violation has been detected on one or several peripherals</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_PERIPHACCERR</name>
              <description>A security violation has been detected on one or several peripherals</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERIPHACCERR</name>
              <description>Enable or disable interrupt for event PERIPHACCERR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERIPHACCERR</name>
              <description>Write '1' to enable interrupt for event PERIPHACCERR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERIPHACCERR</name>
              <description>Write '1' to disable interrupt for event PERIPHACCERR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PERIPHACCERR</name>
          <description>Unspecified</description>
          <headerStructName>SPU_PERIPHACCERR</headerStructName>
          <access>read-write</access>
          <addressOffset>0x404</addressOffset>
          <register>
            <name>ADDRESS</name>
            <description>Address of the transaction that caused first error.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INFO</name>
            <description>Information about  the transaction that caused first error.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>OWNERID</name>
                <description>OWNERID</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>32</dim>
          <dimIncrement>0x004</dimIncrement>
          <name>PERIPH[%s]</name>
          <description>Unspecified</description>
          <headerStructName>SPU_PERIPH</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>PERM</name>
            <description>Description cluster: Get and set the applicable access permissions for the peripheral slave index n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x8000000A</resetValue>
            <fields>
              <field>
                <name>SECUREMAPPING</name>
                <description>Read capabilities for TrustZone Cortex-M secure attribute</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>This peripheral is always accessible as a non-secure peripheral</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>This peripheral is always accessible as a secure peripheral</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UserSelectable</name>
                    <description>Non-secure or secure attribute for this peripheral is defined by the PERIPH[n].PERM register</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Split</name>
                    <description>This peripheral implements the split security mechanism.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMA</name>
                <description>Read the peripheral DMA capabilities</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDMA</name>
                    <description>Peripheral has no DMA capability</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoSeparateAttribute</name>
                    <description>Peripheral has DMA and DMA transfers always have the same security attribute as assigned to the peripheral</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SeparateAttribute</name>
                    <description>Peripheral has DMA and DMA transfers can have a different security attribute than the one assigned to the peripheral</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECATTR</name>
                <description>Peripheral security mapping</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Peripheral is mapped in secure peripheral address space</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>If SECUREMAPPING == UserSelectable: Peripheral is mapped in non-secure peripheral address space. If SECUREMAPPING == Split: Peripheral is mapped in non-secure and secure peripheral address space.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMASEC</name>
                <description>Security attribution for the DMA transfer</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>DMA transfers initiated by this peripheral have the secure attribute set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>DMA transfers initiated by this peripheral have the non-secure attribute set</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BLOCK</name>
                <description>Peripheral block</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Available</name>
                    <description>Peripheral is accessible</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Blocked</name>
                    <description>Peripheral cannot be accessed until next reset</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <description>Register lock</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>This register can be updated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>The content of this register can not be changed until the next reset</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OWNERID</name>
                <description>Peripheral owner ID</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>OWNERPROG</name>
                <description>Indicates if OWNERID is programmable or not</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotProgrammable</name>
                    <description>OWNERID is not programmable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Programmable</name>
                    <description>OWNERID is programmable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRESENT</name>
                <description>Indicates if a peripheral is present with peripheral slave index n</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotPresent</name>
                    <description>Peripheral is not present</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IsPresent</name>
                    <description>Peripheral is present</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
