adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
            <cluster>
              <dim>10</dim>
              <dimIncrement>0x080</dimIncrement>
              <name>GPIO[%s]</name>
              <description>Unspecified</description>
              <headerStructName>GPIO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x200</addressOffset>
              <register>
                <dim>0x20</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>PIN[%s]</name>
                <description>Description collection: Configuration of features for GPIO[n] PIN[o]</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>GRTC</name>
              <description>Unspecified</description>
              <headerStructName>GRTC</headerStructName>
              <alternateCluster>GPIO[%s]</alternateCluster>
              <access>read-write</access>
              <addressOffset>0x200</addressOffset>
              <register>
                <dim>0x18</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>CC[%s]</name>
                <description>Description collection: Configuration of features for CC n of GRTC</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>SYSCOUNTER</name>
                <description>Configuration of features for SYSCOUNTERL/SYSCOUNTERH of GRTC</description>
                <addressOffset>0x07C</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>INTERRUPT[%s]</name>
                <description>Description collection: Configuration of features for interrupt n of GRTC</description>
                <addressOffset>0x080</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>BELLS</name>
            <description>Unspecified</description>
            <headerStructName>SPU_FEATURE_BELLS</headerStructName>
            <alternateCluster>STRUCT0</alternateCluster>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <cluster>
              <dim>16</dim>
              <dimIncrement>0x040</dimIncrement>
              <name>DOMAIN[%s]</name>
              <description>Unspecified</description>
              <headerStructName>SPU_FEATURE_BELLS_DOMAIN</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>BELL[%s]</name>
                <description>Description collection: Configuration of features for bell pair [(o * 2) + 1:o * 2] of domain n</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
        </cluster>
