adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
        <cluster>
          <name>GLITCH</name>
          <description>Unspecified</description>
          <headerStructName>TAMPC_GLITCH</headerStructName>
          <access>read-write</access>
          <addressOffset>0x40C</addressOffset>
          <register>
            <name>CONFIGSLOWDOMAIN</name>
            <description>Configuration for slow domain glitch detectors.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>EXTRADELAY</name>
                <description>Extra delay configuration.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIGFASTDOMAIN</name>
            <description>Configuration for fast domain glitch detectors.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>EXTRADELAY</name>
                <description>Extra delay configuration.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PROTECT</name>
          <description>Unspecified</description>
          <headerStructName>TAMPC_PROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <cluster>
            <dim>128</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>FEATURE[%s]</name>
            <description>Unspecified</description>
            <headerStructName>TAMPC_PROTECT_FEATURE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>CTRL</name>
              <description>Description cluster: Control register for protect feature n.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Set value of protect feature n.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Low</name>
                      <description>Signal is logic 0.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>High</name>
                      <description>Signal is logic 1.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>Lock this register to prevent changes.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>writeonce</access>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Lock disabled.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Lock enabled.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>FAULTTEST</name>
                  <description>Injects a fault in the protected signal.</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoOperation</name>
                      <description>No operation.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Trigger</name>
                      <description>Trigger fault.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>Description cluster: Status register for protect feature n.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <fields>
                <field>
                  <name>ERROR</name>
                  <description>Error detection status.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoError</name>
                      <description>No error detected.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Error</name>
                      <description>Error detected.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>STRUCT0</name>
            <description>Unspecified</description>
            <headerStructName>TAMPC_PROTECT_STRUCT0</headerStructName>
            <alternateCluster>FEATURE[%s]</alternateCluster>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <cluster>
              <dim>16</dim>
              <dimIncrement>0x020</dimIncrement>
              <name>DOMAIN[%s]</name>
              <description>Unspecified</description>
              <headerStructName>TAMPC_PROTECT_STRUCT0_DOMAIN</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <cluster>
                <name>DBGEN</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_DOMAIN_DBGEN</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Description cluster: Control register for invasive (halting) debug enable for the local debug components within domain n.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of dbgen signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Description cluster: Status register for invasive (halting) debug enable for domain n.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>NIDEN</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_DOMAIN_NIDEN</headerStructName>
                <access>read-write</access>
                <addressOffset>0x008</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Description cluster: Control register for non-invasive debug enable for the local debug components within domain n.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of niden signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Description cluster: Status register for non-invasive debug enable for domain n.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>SPIDEN</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_DOMAIN_SPIDEN</headerStructName>
                <access>read-write</access>
                <addressOffset>0x010</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Description cluster: Control register for secure priviliged invasive (halting) debug enable for the local debug components within domain n.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of spiden signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Description cluster: Status register for secure priviliged invasive (halting) debug enable for domain n.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
