adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
              <cluster>
                <name>SPNIDEN</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_DOMAIN_SPNIDEN</headerStructName>
                <access>read-write</access>
                <addressOffset>0x018</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Description cluster: Control register for secure priviliged non-invasive debug enable for the local debug components within domain n.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of spniden signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Description cluster: Status register for secure priviliged non-invasive debug enable for domain n.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <dim>16</dim>
              <dimIncrement>0x010</dimIncrement>
              <name>AP[%s]</name>
              <description>Unspecified</description>
              <headerStructName>TAMPC_PROTECT_STRUCT0_AP</headerStructName>
              <access>read-write</access>
              <addressOffset>0x200</addressOffset>
              <cluster>
                <name>DBGEN</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_AP_DBGEN</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Description cluster: Control register to enable invasive (halting) debug in domain n's access port.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of dbgen signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Description cluster: Status register for invasive (halting) debug enable for domain n's access port.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>SPIDEN</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_AP_SPIDEN</headerStructName>
                <access>read-write</access>
                <addressOffset>0x008</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Description cluster: Control register to enable secure priviliged invasive (halting) debug in domain n's access port.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of spiden signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Description cluster: Status register for secure priviliged invasive (halting) debug enable for domain n's access port.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>CORESIGHT</name>
              <description>Unspecified</description>
              <headerStructName>TAMPC_PROTECT_STRUCT0_CORESIGHT</headerStructName>
              <access>read-write</access>
              <addressOffset>0x300</addressOffset>
              <cluster>
                <name>DEVICEEN</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_CORESIGHT_DEVICEEN</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Controls the access port to the trace and debug domain, part of CoreSight configuration registers.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of deviceen signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Status register for the trace and debug domain access port.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>DBGEN</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_CORESIGHT_DBGEN</headerStructName>
                <access>read-write</access>
                <addressOffset>0x008</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Control register for invasive (halting) debug enable for the Coresight domain.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of dbgen signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
