adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
                <register>
                  <name>STATUS</name>
                  <description>Status register for the SM4 DPA counter-measures disable signal in CRACEN.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>PKDISABLECM</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_CRACEN_PKDISABLECM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x010</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Control register to disable PK engine DPA counter-measures in CRACEN.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of PK engine DPA counter-measures disable signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Status register for the PK engine DPA counter-measures disable signal in CRACEN.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>WARMBOOT</name>
              <description>Unspecified</description>
              <headerStructName>TAMPC_PROTECT_STRUCT0_WARMBOOT</headerStructName>
              <access>read-write</access>
              <addressOffset>0x3E8</addressOffset>
              <cluster>
                <name>UNRETIDLE</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_WARMBOOT_UNRETIDLE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Control register to enable warm boot from unretained idle mode.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of warm boot unretained idle signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Status register for the warm boot unretained idle signal.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>SYSTEMOFF</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_WARMBOOT_SYSTEMOFF</headerStructName>
                <access>read-write</access>
                <addressOffset>0x008</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Control register to enable warm boot from system off mode.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of the warm boot system off signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Status register for the warm boot system off signal.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>DFT</name>
              <description>Unspecified</description>
              <headerStructName>TAMPC_PROTECT_STRUCT0_DFT</headerStructName>
              <access>read-write</access>
              <addressOffset>0x3F8</addressOffset>
              <cluster>
                <name>ENABLE</name>
                <description>Unspecified</description>
                <headerStructName>TAMPC_PROTECT_STRUCT0_DFT_ENABLE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>CTRL</name>
                  <description>Control register to enable DFT mode.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000008</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Set value of dft_enable signal.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Low</name>
                          <description>Signal is logic 0.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>High</name>
                          <description>Signal is logic 1.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>LOCK</name>
                      <description>Lock this register to prevent changes.</description>
                      <lsb>1</lsb>
                      <msb>1</msb>
                      <access>writeonce</access>
                      <modifiedWriteValues>oneToSet</modifiedWriteValues>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Disabled</name>
                          <description>Lock disabled.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Enabled</name>
                          <description>Lock enabled.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>FAULTTEST</name>
                      <description>Injects a fault in the protected signal.</description>
                      <lsb>2</lsb>
                      <msb>2</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoOperation</name>
                          <description>No operation.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Trigger</name>
                          <description>Trigger fault.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                    <field>
                      <name>RDCPROTECT</name>
                      <description>Write protection of VALUE bit.</description>
                      <lsb>3</lsb>
                      <msb>3</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>Unprotected</name>
                          <description>VALUE field is unprotected and can be set.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Protected</name>
                          <description>VALUE field is protected and can not be written.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>STATUS</name>
                  <description>Status register for enable DFT mode.</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                    <field>
                      <name>ERROR</name>
                      <description>Error detection status.</description>
                      <lsb>0</lsb>
                      <msb>0</msb>
                      <enumeratedValues>
                        <enumeratedValue>
                          <name>NoError</name>
                          <description>No error detected.</description>
                          <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                          <name>Error</name>
                          <description>Error detected.</description>
                          <value>0x1</value>
                        </enumeratedValue>
                      </enumeratedValues>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
        </cluster>
