adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
          <register>
            <name>COUNTERRELOAD</name>
            <description>Configures the counter reload value. The counter is reloaded and starts counting from the 
                  CLK/PROGEN rising edge.</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Counter reload value.</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COUNTERRUN</name>
            <description>Returns the state (counting or not) of the counter</description>
            <addressOffset>0x044</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RUNNING</name>
                <description>Returns the state of the counter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotRunning</name>
                    <description>Counter is not running</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Running</name>
                    <description>Counter is running</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>TESTMODE2 Configuration</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ENABLECOUNTER</name>
                <description>Enable counter</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Counter is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Counter is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COUNTERSTART</name>
                <description>Counter start configuration</description>
                <lsb>1</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>The counter is not active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLK</name>
                    <description>The counter start on rising edge of CLK</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PROGEN</name>
                    <description>The counter start on rising edge of PROGEN</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READLATCH</name>
                <description>Configuration for latching the read/compare data</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RDY</name>
                    <description>Latch the read data on the next rising edge on RDY after CLK going high</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CounterTimeout</name>
                    <description>Latch the read data when the counter expires after CLK going high</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READDATA</name>
                <description>Configuration for the read to DATA, DATAINC, DATAECC and DATAECCINC,
                  and TESTCMP</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Direct</name>
                    <description>Read the data directly from the MRAM data bus</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Latched</name>
                    <description>Read the last latched data from the MRAM data bus</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TESTCMPECC</name>
                <description>Configuration for TESTCMP to exclude ECC or not while comparison</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Compare both corresponding DATA and DATAECC with the direct/latched MRAM data</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Compare only corresponding DATA with the direct/latched MRAM data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTOINC</name>
                <description>Controls the address auto-increment feature</description>
                <lsb>6</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoIncrement</name>
                    <description>Address auto-incrementing is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Increment1</name>
                    <description>Address auto-increment by one MRAM word</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Increment2</name>
                    <description>Address auto-increment by two MRAM words</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITETRIGGER</name>
                <description>Configuration for write trigger</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>Write pulse handled manually.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATAWORD0</name>
                    <description>Writing to DATA[0] or DATAINC[0] triggers write pulse</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATAWORD1</name>
                    <description>Writing to DATA[1] or DATAINC[1] triggers write pulse</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATAWORD2</name>
                    <description>Writing to DATA[2] or DATAINC[2] triggers write pulse</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATAWORD3</name>
                    <description>Writing to DATA[3] or DATAINC[3] triggers write pulse</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATAECC</name>
                    <description>Writing to DATAECC or DATAECCINC triggers write to pulse</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TMOEN</name>
            <description>Enable the pin multiplexing for TMO[2:0] pins of the MRAM macro</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable or disable the TMO[2:0] pin multiplexing with analog IO pads.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable multiplexing</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable multiplexing</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BURSTWORDSNUM</name>
            <description>Number of words for burst read or write</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>WORDS</name>
                <description>Number of words for burst read or write.</description>
                <lsb>0</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BURSTMODESTAT</name>
            <description>The burst mode operation status.</description>
            <addressOffset>0x054</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DONE</name>
                <description>The burst mode operation is completed.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotActive</name>
                    <description>Burst mode operation not active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Running</name>
                    <description>Burst mode is running</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Done</name>
                    <description>The last burst mode operation is completed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Error</name>
                    <description>The last burst mode operation is completed with errors for read operation</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ONEBITERR</name>
            <description>Number of one bit error words detected while compare in the last burst mode read operation.</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Number of words with one bit errors.</description>
                <lsb>0</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TWOBITSERR</name>
            <description>Number of two bit errors words detected while compare in the last burst mode read operation.</description>
            <addressOffset>0x05C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Number of words with one bit errors.</description>
                <lsb>0</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MANYBITSERR</name>
            <description>Number of more than two bit errors words detected while compare in the last burst mode read operation.</description>
            <addressOffset>0x060</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Number of words with more than two bit errors.</description>
                <lsb>0</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ONEBITERRTHR</name>
            <description>Threshold in terms of number of one bit error words to end the burst mode read operation with error.</description>
            <addressOffset>0x064</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Number of words with one bit errors.</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TWOBITSERRTHR</name>
            <description>Threshold in terms of number of two bits error words to end the burst mode read operation with error.</description>
            <addressOffset>0x068</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Number of words with two bits errors.</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MANYBITSERRTHR</name>
            <description>Threshold in terms of number of more than two bits error words to end the burst mode read operation with error.</description>
            <addressOffset>0x06C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Number of words with more than two bits errors.</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
        </cluster>
