adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P1_NS</name>
      <description>GPIO Port 1</description>
      <baseAddress>0x4F938200</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P2_NS</name>
      <description>GPIO Port 2</description>
      <baseAddress>0x4F938400</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P3_NS</name>
      <description>GPIO Port 3</description>
      <baseAddress>0x4F938600</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P4_NS</name>
      <description>GPIO Port 4</description>
      <baseAddress>0x4F938800</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P5_NS</name>
      <description>GPIO Port 5</description>
      <baseAddress>0x4F938A00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P6_NS</name>
      <description>GPIO Port 6</description>
      <baseAddress>0x4F938C00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P7_NS</name>
      <description>GPIO Port 7</description>
      <baseAddress>0x4F938E00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P0_S</name>
      <description>GPIO Port 8</description>
      <baseAddress>0x5F938000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P1_S</name>
      <description>GPIO Port 9</description>
      <baseAddress>0x5F938200</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P2_S</name>
      <description>GPIO Port 10</description>
      <baseAddress>0x5F938400</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P3_S</name>
      <description>GPIO Port 11</description>
      <baseAddress>0x5F938600</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P4_S</name>
      <description>GPIO Port 12</description>
      <baseAddress>0x5F938800</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P5_S</name>
      <description>GPIO Port 13</description>
      <baseAddress>0x5F938A00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P6_S</name>
      <description>GPIO Port 14</description>
      <baseAddress>0x5F938C00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P7_S</name>
      <description>GPIO Port 15</description>
      <baseAddress>0x5F938E00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P8_NS</name>
      <description>GPIO Port 16</description>
      <baseAddress>0x4F939000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P9_NS</name>
      <description>GPIO Port 17</description>
      <baseAddress>0x4F939200</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P10_NS</name>
      <description>GPIO Port 18</description>
      <baseAddress>0x4F939400</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P11_NS</name>
      <description>GPIO Port 19</description>
      <baseAddress>0x4F939600</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P12_NS</name>
      <description>GPIO Port 20</description>
      <baseAddress>0x4F939800</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P13_NS</name>
      <description>GPIO Port 21</description>
      <baseAddress>0x4F939A00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P14_NS</name>
      <description>GPIO Port 22</description>
      <baseAddress>0x4F939C00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_GPIOINTERNAL_NS</name>
      <description>GPIO Internal 0</description>
      <baseAddress>0x4F939E00</baseAddress>
      <headerStructName>GPIOINTERNAL</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>GPIOINTERNAL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>LATCHCLRWAITCNT</name>
          <description>Select the number of wait cycles inserted on the bus when a LATCH register is cleared.</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>LATCHCLRWAITCNT</name>
              <description>Select the number of wait cycles inserted on the bus when a LATCH register is cleared.</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCELDETECTLOWCNT</name>
          <description>Select the number of cycles that LDETECT is forced low after clearing a LATCH register.</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>FORCELDETECTLOWCNT</name>
              <description>Select the number of cycles that LDETECT is forced low after clearing a LATCH register.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET</name>
          <description>Reset all GPIO registers.</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>RESET</name>
              <description>Reset all GPIO registers.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Trigger reset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SENSECONFIGCHANGECNT</name>
          <description>Selects the number of cycles before the SENSE configuration takes effect when it is changed. Setting this register lower than the reset value can lead to unwanted LATCH set
        when SENSE and INPUT fields (PIN[n].CNF) are changed simultaneously.</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>SENSECONFIGCHANGECNT</name>
              <description>Selects the number of cycles before the SENSE configuration takes effect when it is changed.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PCGC</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_GPIOINTERNAL_PCGC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x050</addressOffset>
          <register>
            <name>TRIGZEROPENALTY</name>
            <description>Trigger zero penalty</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <!--Security securemapping=S-->
            <fields>
              <field>
                <name>TRIGGER</name>
                <description>TRIGGER</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Trigger zero penalty</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIGFULLPENALTY</name>
            <description>Trigger full penalty</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <!--Security securemapping=S-->
            <fields>
              <field>
                <name>TRIGGER</name>
                <description>TRIGGER</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Trigger full penalty</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PENALTY[%s]</name>
            <description>Description collection: Penalty level for power/clock pair n</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <!--Security securemapping=S-->
            <fields>
              <field>
                <name>PENALTY</name>
                <description>Penalty level</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FORCEOVERRIDE[%s]</name>
            <description>Description collection: Force override of power/clock pair n</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <!--Security securemapping=S-->
            <fields>
              <field>
                <name>CLOCKFORCINGPRE</name>
                <description>CLOCKFORCINGPRE</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>DOFORCECLOCKPRE</name>
                <description>DOFORCECLOCKPRE</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>POWERFORCINGPRE</name>
                <description>POWERFORCINGPRE</description>
                <lsb>8</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DOFORCEPOWERPRE</name>
                <description>DOFORCEPOWERPRE</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
