adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure.svd
          <register>
            <name>RXEN</name>
            <description>Reception (RX) enable</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RXEN</name>
                <description>Reception (RX) enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Reception disabled and now data will be written to the RXD.PTR address.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Reception enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TXEN</name>
            <description>Transmission (TX) enable</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>TXEN</name>
                <description>Transmission (TX) enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Transmission disabled and now data will be read from the RXD.TXD address.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Transmission enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCKEN</name>
            <description>Master clock generator enable</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>MCKEN</name>
                <description>Master clock generator enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Master clock generator disabled and PSEL.MCK not connected(available as GPIO).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Master clock generator running and MCK output on PSEL.MCK.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCKFREQ</name>
            <description>I2S clock generator control</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x20000000</resetValue>
            <fields>
              <field>
                <name>MCKFREQ</name>
                <description>I2S MCK frequency configuration NOTE: Enumerations are deprecated, use MCKFREQ equation. NOTE: The 12 least significant bits of the register are ignored and shall be set to zero.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>32MDIV2</name>
                    <description>32 MHz / 2 = 16.0 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x80000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV3</name>
                    <description>32 MHz / 3 = 10.6666667 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x50000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV4</name>
                    <description>32 MHz / 4 = 8.0 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x40000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV5</name>
                    <description>32 MHz / 5 = 6.4 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x30000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV6</name>
                    <description>32 MHz / 6 = 5.3333333 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x28000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV8</name>
                    <description>32 MHz / 8 = 4.0 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x20000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV10</name>
                    <description>32 MHz / 10 = 3.2 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x18000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV11</name>
                    <description>32 MHz / 11 = 2.9090909 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x16000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV15</name>
                    <description>32 MHz / 15 = 2.1333333 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x11000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV16</name>
                    <description>32 MHz / 16 = 2.0 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x10000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV21</name>
                    <description>32 MHz / 21 = 1.5238095 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x0C000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV23</name>
                    <description>32 MHz / 23 = 1.3913043 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x0B000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV30</name>
                    <description>32 MHz / 30 = 1.0666667 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x08800000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV31</name>
                    <description>32 MHz / 31 = 1.0322581 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x08400000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV32</name>
                    <description>32 MHz / 32 = 1.0 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x08000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV42</name>
                    <description>32 MHz / 42 = 0.7619048 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x06000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV63</name>
                    <description>32 MHz / 63 = 0.5079365 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x04100000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV125</name>
                    <description>32 MHz / 125 = 0.256 MHz Deprecated, use MCKFREQ equation.</description>
                    <value>0x020C0000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RATIO</name>
            <description>MCK / LRCK ratio</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000006</resetValue>
            <fields>
              <field>
                <name>RATIO</name>
                <description>MCK / LRCK ratio</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>32X</name>
                    <description>LRCK = MCK / 32</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>48X</name>
                    <description>LRCK = MCK / 48</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64X</name>
                    <description>LRCK = MCK / 64</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>96X</name>
                    <description>LRCK = MCK / 96</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128X</name>
                    <description>LRCK = MCK / 128</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>192X</name>
                    <description>LRCK = MCK / 192</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256X</name>
                    <description>LRCK = MCK / 256</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>384X</name>
                    <description>LRCK = MCK / 384</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512X</name>
                    <description>LRCK = MCK / 512</description>
                    <value>0x8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SWIDTH</name>
            <description>Sample width</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>SWIDTH</name>
                <description>Sample and half-frame width</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>8Bit</name>
                    <description>8 bit sample.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Bit</name>
                    <description>16 bit sample.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>24Bit</name>
                    <description>24 bit sample.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32Bit</name>
                    <description>32 bit sample.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8BitIn16</name>
                    <description>8 bit sample in a 16-bit half-frame.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8BitIn32</name>
                    <description>8 bit sample in a 32-bit half-frame.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16BitIn32</name>
                    <description>16 bit sample in a 32-bit half-frame.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>24BitIn32</name>
                    <description>24 bit sample in a 32-bit half-frame.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ALIGN</name>
            <description>Alignment of sample within a frame</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ALIGN</name>
                <description>Alignment of sample within a frame</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Left</name>
                    <description>Left-aligned.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Right</name>
                    <description>Right-aligned.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORMAT</name>
            <description>Frame format</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FORMAT</name>
                <description>Frame format</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>I2S</name>
                    <description>Original I2S format.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Aligned</name>
                    <description>Alternate (left- or right-aligned) format.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CHANNELS</name>
            <description>Enable channels</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CHANNELS</name>
                <description>Enable channels</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Stereo</name>
                    <description>Stereo.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Left</name>
                    <description>Left only.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Right</name>
                    <description>Right only.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CLKCONFIG</name>
            <description>Clock source selection for the I2S module</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CLKSRC</name>
                <description>Clock source selection</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PCLK32M</name>
                    <description>32MHz peripheral clock</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACLK</name>
                    <description>Audio PLL clock</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASS</name>
                <description>Bypass clock generator. MCK will be equal to source input. If bypass is enabled the MCKFREQ setting has no effect.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable bypass</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable bypass</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>JITTER</name>
                <description>Enable jittering clock.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Disable jitter</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Enable jitter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RXD</name>
          <description>Unspecified</description>
          <headerStructName>I2S_RXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x538</addressOffset>
          <register>
            <name>PTR</name>
            <description>Receive buffer RAM start address.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PTR</name>
                <description>Receive buffer Data RAM start address. When receiving, words containing samples will be written to this address. This address is a word aligned Data RAM address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TXD</name>
          <description>Unspecified</description>
          <headerStructName>I2S_TXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>PTR</name>
            <description>Transmit buffer RAM start address</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PTR</name>
                <description>Transmit buffer Data RAM start address. When transmitting, words containing samples will be fetched from this address. This address is a word aligned Data RAM address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RXTXD</name>
          <description>Unspecified</description>
          <headerStructName>I2S_RXTXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x550</addressOffset>
          <register>
            <name>MAXCNT</name>
            <description>Size of RXD and TXD buffers</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Size of RXD and TXD buffers in number of 32 bit words</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of 32 bit words sent and received since the previous END event. Nice to have only. TBD.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of 32 bit words sent and received since the previous END event</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
        </cluster>
